setwd("D:\\Github_Code\\R-tidyverse-")
#----------------------------------------------------------------
#一、分支结构
# if(条件1) {    
#   执行体1    
# } else if(条件2) {    
#   执行体2    
# } else {    
#   执行体n    
# }
x <- 3
if(x==2){
  x <- x+2
}else{
  x <- x+3
}
x

#switch分支
x = "b"
v = switch(x, "a"="apple", "b"="banana", "c"="cherry")
v
#----------------------------------------------------------------


#----------------------------------------------------------------
#二、循环结构
# R循环的三层境界：
# 
# 第一层：for循环、while循环、repeat循环
# 第二层：apply函数族
# 第三层：purrr泛函式编程
# 关于跳出循环：
# 
# 用关键字 next 跳出本次循环，进入下次循环
# 用关键词 break 跳出循环
# 如今for并不慢，只需要注意：
# 提前为保存循环结果分配存储空间
# 为循环体中涉及的数据选择合适的数据结构


#----------------------------------------------------------------

#三、自带循环迭代
library(tidyverse)
library(tibble)
df = as_tibble(iris[1:10,1:4])
df
output <-  vector("double", 4)       # 1.输出
for (i in 1:4) {                   # 2.迭代器
  output[i] = mean(df[[i]])        # 3.循环体
}
output


























